/*
Создайте класс Cat и класс Dog. В классе Cat должен быть метод sayHello(), который выводит в консоль "Мяу!", аналогично с собакой, но выводит "Гав!". Так же, у собаки должен быть метод catchCat (поймать кошку), который принимает кошку и дальше делает следующее:

 
1) выводит в консоль сообщение "Кошка поймана"
2) У собаки, которая поймала кошку должен быть вызван метод sayHello()
3) У кошки, которую поймала собака должен быть вызван метод sayHello()
 
Требования:
1. Должен быть класс public static class Cat
2. Должен быть класс public static class Dog
3. Все методы должны быть public
4. Кошка должна говорить “Мяу!”
5. Собака должна говорить “Гав!”
6. Собака должна ловить кошку

*/

public static class Cat {              //1. Должен быть класс public static class Cat
    public void sayHello() {           //3. Все методы должны быть public
        System.out.println("Мяу!");    //4. Кошка должна говорить “Мяу!”
    }
}

public static class Dog {              //2. Должен быть класс public static class Dog
    public void sayHello() {           //3. Все методы должны быть public
        System.out.println("Гав!");    //5. Собака должна говорить “Гав!”
    }

    public void catchCat(Cat cat) {            //6. Собака должна ловить кошку  //3. Все методы должны быть public
        System.out.println("Кошка поймана");
        
        new Dog().sayHello();
        cat.sayHello();
    }
}
